; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem dev_n4_006-W) (:domain depots)
(:objects
	crate0 crate1 crate2 crate3 - crate
	depot0 - depot
	distributor0 distributor1 - distributor
	hoist0 hoist1 hoist2 - hoist
	pallet0 pallet1 pallet2 pallet3 pallet4 - pallet
	truck0 - truck
)
(:init
	(at crate0 distributor1)
	(at crate1 distributor1)
	(at crate2 distributor1)
	(at crate3 distributor1)
	(at hoist0 depot0)
	(at hoist1 distributor0)
	(at pallet0 depot0)
	(at pallet1 distributor1)
	(at pallet2 distributor0)
	(at pallet3 distributor0)
	(at truck0 distributor0)
	(available hoist0)
	(available hoist1)
	(clear crate3)
	(clear pallet0)
	(clear pallet2)
	(clear pallet3)
	(on crate0 pallet1)
	(on crate1 crate0)
	(on crate2 crate1)
	(on crate3 crate2)
	(at hoist2 distributor1)
	(available hoist2)
	(at pallet4 distributor1)
	(clear pallet4)
)
(:goal (and
	(on crate0 crate2)
	(on crate1 pallet3)
	(on crate2 pallet2)
	(on crate3 pallet1)
))
)

; plan
1. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 0 of 4
2. (lift hoist2 crate3 crate2 distributor1)
   deleted: (at crate3 distributor1) (available hoist2) (on crate3 crate2) (clear crate3)
   added: (lifting hoist2 crate3) (clear crate2)
   goals met: 0 of 4
3. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   goals met: 0 of 4
4. (lift hoist2 crate2 crate1 distributor1)
   deleted: (at crate2 distributor1) (available hoist2) (on crate2 crate1) (clear crate2)
   added: (lifting hoist2 crate2) (clear crate1)
   goals met: 0 of 4
5. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   goals met: 0 of 4
6. (lift hoist2 crate1 crate0 distributor1)
   deleted: (at crate1 distributor1) (available hoist2) (on crate1 crate0) (clear crate1)
   added: (lifting hoist2 crate1) (clear crate0)
   goals met: 0 of 4
7. (load hoist2 crate1 truck0 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck0) (available hoist2)
   goals met: 0 of 4
8. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 0 of 4
9. (unload hoist1 crate1 truck0 distributor0)
   deleted: (available hoist1) (in crate1 truck0)
   added: (lifting hoist1 crate1)
   goals met: 0 of 4
10. (drop hoist1 crate1 pallet3 distributor0)
   deleted: (lifting hoist1 crate1) (clear pallet3)
   added: (at crate1 distributor0) (available hoist1) (on crate1 pallet3) (clear crate1)
   goals met: 1 of 4
11. (unload hoist1 crate2 truck0 distributor0)
   deleted: (available hoist1) (in crate2 truck0)
   added: (lifting hoist1 crate2)
   goals met: 1 of 4
12. (drop hoist1 crate2 pallet2 distributor0)
   deleted: (lifting hoist1 crate2) (clear pallet2)
   added: (at crate2 distributor0) (available hoist1) (on crate2 pallet2) (clear crate2)
   goals met: 2 of 4
13. (lift hoist2 crate0 pallet1 distributor1)
   deleted: (at crate0 distributor1) (available hoist2) (on crate0 pallet1) (clear crate0)
   added: (lifting hoist2 crate0) (clear pallet1)
   goals met: 2 of 4
14. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 2 of 4
15. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   goals met: 2 of 4
16. (unload hoist2 crate3 truck0 distributor1)
   deleted: (available hoist2) (in crate3 truck0)
   added: (lifting hoist2 crate3)
   goals met: 2 of 4
17. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 2 of 4
18. (unload hoist1 crate0 truck0 distributor0)
   deleted: (available hoist1) (in crate0 truck0)
   added: (lifting hoist1 crate0)
   goals met: 2 of 4
19. (drop hoist2 crate3 pallet1 distributor1)
   deleted: (lifting hoist2 crate3) (clear pallet1)
   added: (at crate3 distributor1) (available hoist2) (on crate3 pallet1) (clear crate3)
   goals met: 3 of 4
20. (drop hoist1 crate0 crate2 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate2)
   added: (at crate0 distributor0) (available hoist1) (on crate0 crate2) (clear crate0)
   goals met: 4 of 4
